matthewgream/gps-logger-mg/mod_lpc21XXhal.c

/* ----------------------------------------------------------------------------------------------------*/
/*
	mod_lpc21XXhal.c: gps logger module for LPC21XX hardware interface.
	copyright (c) 2007 gps_logger_mg@tanundra.com. all rights reserved.
	refer to the associated LICENSE file for licensing terms/conditions.
 */
/* ----------------------------------------------------------------------------------------------------*/

#include "common.h"
#include "mod_lpc21XXhal.h"

#ifndef INLINE
/*@-namechecks@*/
#include "targets/lpc213x.h"
/*@+namechecks@*/
#endif

/*@-exportheader@*/
/*@-exportlocal@*/

/* ----------------------------------------------------------------------------------------------------*/

#ifndef SPLINT
#define LPC21XX_NOP()		asm volatile ("nop")
#else
#define LPC21XX_NOP()		
#endif

#ifndef INLINE
#define LPC21XX_SPI_CS	((unsigned long) 0x00000080)
#endif

/* ----------------------------------------------------------------------------------------------------*/

/*@i@*/ void __div0 (void)
{
		HALT (("divide_by_zero"));
}

/* ----------------------------------------------------------------------------------------------------*/

void __attribute__ ((interrupt ("UNDEF"))) undef_handler (void)
{
		HALT (("undef_handler"));
}

void __attribute__ ((interrupt ("SWI"))) swi_handler (void)
{
		HALT (("swi_handler"));
}

void __attribute__ ((interrupt ("PABORT"))) pabort_handler (void)
{
		HALT (("pabort_handler"));
}

void __attribute__ ((interrupt ("DABORT"))) dabort_handler (void)
{
		HALT (("dabort_handler"));
}

void __attribute__ ((interrupt ("IRQ"))) irq_handler (void)
{
		HALT (("irq_handler"));
}

void __attribute__ ((interrupt ("FIQ"))) fiq_handler (void)
{
		HALT (("fiq_handler"));
}

/* ----------------------------------------------------------------------------------------------------*/

#define LPC21XX_IRQ_MASK	  ((unsigned long) 0x00000080)
#define LPC21XX_FIQ_MASK	  ((unsigned long) 0x00000040)

#define LPC21XX_IRQ_CLEAR	  VICVectAddr = ((unsigned long) 0x00000000)

#ifndef SPLINT
#define LPC21XX_CPSR_GET(r)	  asm volatile (" mrs %0, cpsr" : "=r" (r) : /* null */ )
#define LPC21XX_CPSR_SET(r)	  asm volatile (" msr cpsr, %0" : /* null */ : "r" (r) )
#else
#define LPC21XX_CPSR_GET(r)	  r = 0
#define LPC21XX_CPSR_SET(r)	  UNUSED (r)
#endif

static inline unsigned long lpc21XX_irq_disable (void)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET (r | LPC21XX_IRQ_MASK);
		return r;
}

static inline unsigned long lpc21XX_irq_enable (void)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET (r & ~LPC21XX_IRQ_MASK);
		return r;
}

static inline unsigned long lpc21XX_irq_restore (const unsigned long v)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET ((r & ~LPC21XX_IRQ_MASK) | (v & LPC21XX_IRQ_MASK));
		return r;
}

#define lpc21XX_irq_complete() LPC21XX_IRQ_CLEAR

static inline unsigned long lpc21XX_fiq_disable (void)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET (r | LPC21XX_FIQ_MASK);
		return r;
}

#ifdef LPC21XX_ENABLE_FIQ

static inline unsigned long lpc21XX_fiq_enable (void)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET (r & ~LPC21XX_FIQ_MASK);
		return r;
}

static inline unsigned long lpc21XX_fiq_restore (const unsigned long v)
{
		unsigned long r;
		LPC21XX_CPSR_GET (r);
		LPC21XX_CPSR_SET ((r & ~LPC21XX_FIQ_MASK) | (v & LPC21XX_FIQ_MASK));
		return r;
}

#endif

/* ----------------------------------------------------------------------------------------------------*/

/* add others as required */
#define LPC21XX_IRQ_CHANNEL_WDT		((unsigned char) 0)
#define LPC21XX_IRQ_CHANNEL_TIMER0	((unsigned char) 4)
#define LPC21XX_IRQ_CHANNEL_TIMER1	((unsigned char) 5)
#define LPC21XX_IRQ_CHANNEL_UART0	((unsigned char) 6)
#define LPC21XX_IRQ_CHANNEL_UART1	((unsigned char) 7)
#define LPC21XX_IRQ_CHANNEL_EINT0	((unsigned char) 14)
#define LPC21XX_IRQ_CHANNEL_BOD		((unsigned char) 20)
#define LPC21XX_IRQ_CHANNEL_MAX		((unsigned char) 22)

#define LPC21XX_IRQ_VECTOR_SIZE		((unsigned char) 16)
#define LPC21XX_IRQ_VECTOR_ADDR(o)	(*((volatile unsigned long *) (0xFFFFF100 + (((unsigned long) o) << 2))))
#define LPC21XX_IRQ_VECTOR_CTRL(o)	(*((volatile unsigned long *) (0xFFFFF200 + (((unsigned long) o) << 2))))

static void lpc21XX_irq_vector_attach (const unsigned char irq, const unsigned long handler)
{
		unsigned char offset;

		assert (irq < LPC21XX_IRQ_CHANNEL_MAX);
		assert (handler != 0);

		for (offset = (unsigned char) 0; offset < LPC21XX_IRQ_VECTOR_SIZE; offset += (unsigned char) 1)
		{
				if ((LPC21XX_IRQ_VECTOR_CTRL (offset) & 0x20) == 0x00)
				{
						const unsigned long c = lpc21XX_irq_disable ();

						LPC21XX_IRQ_VECTOR_ADDR (offset) = handler;
						LPC21XX_IRQ_VECTOR_CTRL (offset) = (unsigned long) (0x20 | irq);

						VICIntSelect &= ~(1L << irq); /* set IRQ to be vectored */
						VICIntEnable |= (1L << irq);  /* enable IRQ */

						(void) lpc21XX_irq_restore (c);

						break;
				}
		}

		assert (offset < LPC21XX_IRQ_VECTOR_SIZE);
}

static void lpc21XX_irq_vector_detach (const unsigned char irq)
{
		unsigned char offset;

		assert (irq < LPC21XX_IRQ_CHANNEL_MAX);

		for (offset = (unsigned char) 0; offset < LPC21XX_IRQ_VECTOR_SIZE; offset += (unsigned char) 1)
		{
				if ((unsigned char) (LPC21XX_IRQ_VECTOR_CTRL (offset) & 0x20) != (unsigned char) 0x00 && (unsigned char) (LPC21XX_IRQ_VECTOR_CTRL (offset) & 0x1F) == irq)
				{
						const unsigned long c = lpc21XX_irq_disable ();

						LPC21XX_IRQ_VECTOR_CTRL (offset) = 0x00000000;
						LPC21XX_IRQ_VECTOR_ADDR (offset) = 0x00000000;

						(void) lpc21XX_irq_restore (c);

						break;
				}
		}

		VICIntEnClr = (unsigned long) (1L << irq); /* disable IRQ */
}

/* ----------------------------------------------------------------------------------------------------*/

static void lpc21XX_irq_init (void)
{
		/* interrupt vectors in flash */
		MEMMAP = (unsigned char) (0x01 & MEMMAP_MAP1_0_MASK);

		/* interrupt config: nothing */
		VICIntEnClr	 = (unsigned long) 0xFFFFFFFF;
		VICIntSelect = (unsigned long) 0x00000000;
		VICIntEnable = (unsigned long) 0x00000000;
		VICDefVectAddr = (unsigned long) irq_handler;

		/* irq enabled, fiq disabled */
		(void) lpc21XX_irq_enable ();
		(void) lpc21XX_fiq_disable ();

