matthewgream/gps-logger-mg/mod_lpc21XXhal.c
		/* EXTWAKE */
}

static void lpc21XX_irq_term (void)
{
		/* irq disabled, fiq disabled */
		(void) lpc21XX_irq_disable ();
		(void) lpc21XX_fiq_disable ();

		/* clear default vector address */
		VICDefVectAddr = (unsigned long) 0x00000000;
}

/* ----------------------------------------------------------------------------------------------------*/

#define LPC21XX_FOSC	(14745)
#define LPC21XX_MSEL	(3)
#define LPC21XX_PSEL	(1)
#define LPC21XX_VPBD	(1)

#define LPC21XX_CCLK	(LPC21XX_FOSC * LPC21XX_MSEL)
#define LPC21XX_PCLK	(LPC21XX_CCLK)

boolean lpc21XX_init (const int argc, const char ** const argv)
{
		UNUSED (argc);
		UNUSED (argv);

		DPRINTF (("lpc21XX_init\n"));

		/* setup, enable, waitfor & connect PLL */
		PLLCFG = (unsigned char) (LPC21XX_PSEL<<PLLCFG_PSEL1_0_BIT)|(LPC21XX_MSEL<<PLLCFG_MSEL4_0_BIT);
		PLLFEED = (unsigned char) 0xAA; PLLFEED = (unsigned char) 0x55;
		PLLCON = (unsigned char) PLLCON_PLLE;
		PLLFEED = (unsigned char) 0xAA; PLLFEED = (unsigned char) 0x55;
		while ((PLLSTAT & PLLSTAT_PLOCK) == 0x00)
				/*@i@*/ ;
		PLLCON = (unsigned char) (PLLCON_PLLE|PLLCON_PLLC);
		PLLFEED = (unsigned char) 0xAA; PLLFEED = (unsigned char) 0x55;

		/* enable memory acceleration module (MAM) w/ cclks=4 */
		MAMCR = (unsigned char) (0x02 & MAMCR_MAM_mode_control_MASK); /* MAM fully enabled */
		MAMTIM = (unsigned char) (0x04 & MAMTIM_MAM_Fetch_Cycle_timing_MASK); /* MAM fetch is 4 clock cycles */
		/* XXX increase MAMTIM ? */

		/* config peripheral clock (pclk) to system clock (cclk) */
		VPBDIV = (unsigned char) (LPC21XX_VPBD & VPBDIV_VPBDIV_MASK); /* XXX try 0x02 for half */

		/* configure power control: disable BOD entirely */
		PCON = (unsigned char) 0x1C;

		/* disable all peripherals by default (will be enabled as
		   required by specific software modules) */
		PCONP = (unsigned char) 0x00;

#ifdef HARDWARE_24
		/* XXX what is this doing for V2.4 ? */
		IO0DIR |= 0x00020000;
#endif

		/* initialise interrupt handling */
		lpc21XX_irq_init ();

		/* initialise leds */
		lpc21XX_led_init ();

		return TRUE;
}

/* ----------------------------------------------------------------------------------------------------*/

boolean lpc21XX_term (void)
{
		DPRINTF (("lpc21XX_term\n"));

		/* disable irq's */
		(void) lpc21XX_irq_term ();

		/* disable watchdog */
		WDMOD = (unsigned long) 0;
		/* disable powerfail */
		PCON &= ~(1<<4);
		/* disable shutdown */
		EXTINT = (unsigned char) ((1<<EXTINT_EINT0_BIT) & EXTINT_EINT0_MASK);
		EXTMODE &= ~(1<<0);
		/* disable timer0 */
		T0TCR = (unsigned char) 0x00;
		/* disable spi */
		PINSEL0 &= ~((1L<<8)|(1L<<10)|(1L<<12)); /* 3 SPI pins */
		IO0DIR &= ~LPC21XX_SPI_CS;
		/* disable RTC */
		CCR &= (unsigned long) ~CCR_CLKEN;

		/* disable all peripherals */
		PCONP = (unsigned char) 0x00;

		return TRUE;
}

/* ----------------------------------------------------------------------------------------------------*/

boolean lpc21XX_rtc_enabled (void)
{
		return ((PCONP & PCONP_PCRTC) != 0x00) ? TRUE : FALSE;
}

void lpc21XX_rtc_enable (void)
{
		PCONP |= PCONP_PCRTC;

		CCR &= (unsigned long) ~CCR_CLKEN;
		YEAR = (unsigned long) 1980;
		MONTH = (unsigned long) 1;
		DOM = (unsigned long) 1;
		HOUR = (unsigned long) 0;
		MIN = (unsigned long) 0;
		SEC = (unsigned long) 0;
		CCR = (unsigned long) (0x10|CCR_CLKEN); /* CLKSRC=1 (use the pre-scalar) */
}

void lpc21XX_rtc_disable (void)
{
		CCR &= (unsigned long) ~CCR_CLKEN;
		PCONP &= ~PCONP_PCRTC;
}

void lpc21XX_rtc_get (lpc21XX_rtc_t * const c)
{
		assert (c != NULL);

		c->e [LPC21XX_RTC_ELEM_YY] = (unsigned char) (YEAR - 1980);
		c->e [LPC21XX_RTC_ELEM_MO] = (unsigned char) MONTH;
		c->e [LPC21XX_RTC_ELEM_DD] = (unsigned char) DOM;
		c->e [LPC21XX_RTC_ELEM_HH] = (unsigned char) HOUR;
		c->e [LPC21XX_RTC_ELEM_MM] = (unsigned char) MIN;
		c->e [LPC21XX_RTC_ELEM_SS] = (unsigned char) SEC;
}

void lpc21XX_rtc_set (const lpc21XX_rtc_t * const c)
{
		unsigned long occr = CCR;

		assert (c != NULL);
		assert (c->e [LPC21XX_RTC_ELEM_YY] < (unsigned char) 90 && c->e [LPC21XX_RTC_ELEM_MO] <= (unsigned char) 12 && c->e [LPC21XX_RTC_ELEM_DD] <= (unsigned char) 31 &&
				c->e [LPC21XX_RTC_ELEM_HH] < (unsigned char) 24 && c->e [LPC21XX_RTC_ELEM_MM] < (unsigned char) 60 && c->e [LPC21XX_RTC_ELEM_SS] < (unsigned char) 60);

		CCR &= (unsigned long) ~CCR_CLKEN;
		YEAR = (unsigned long) ((int) c->e [LPC21XX_RTC_ELEM_YY] + (int) 1980);
		MONTH = (unsigned long) c->e [LPC21XX_RTC_ELEM_MO];
		DOM = (unsigned long) c->e [LPC21XX_RTC_ELEM_DD];
		HOUR = (unsigned long) c->e [LPC21XX_RTC_ELEM_HH];
		MIN = (unsigned long) c->e [LPC21XX_RTC_ELEM_MM];
		SEC = (unsigned long) c->e [LPC21XX_RTC_ELEM_SS];
		CCR = occr; /* CLKEN restored */
}

/* ----------------------------------------------------------------------------------------------------*/

void lpc21XX_delay (const unsigned int count)
{
		unsigned int index;

		for (index = 0; index < count; index++)
		{
				LPC21XX_NOP ();
				LPC21XX_NOP ();
				LPC21XX_NOP ();
				LPC21XX_NOP ();
				LPC21XX_NOP ();
		}
}

/* ----------------------------------------------------------------------------------------------------*/

#ifndef INLINE
#ifndef SPLINT
#define LPC21XX_POWER_IDLE		do { PCON |= PCON_IDL; } while (FALSE)
#define LPC21XX_POWER_DOWN		do { PCON |= PCON_PD; } while (FALSE)
#else
#define LPC21XX_POWER_IDLE		/*@i@*/ do { } while (FALSE)
#define LPC21XX_POWER_DOWN		/*@i@*/ do { } while (FALSE)
#endif
#endif

#ifndef INLINE
INLINE_DECL void lpc21XX_idle (void)
{
		LPC21XX_POWER_IDLE;
}
#endif

void lpc21XX_down (void)
{
		unsigned int led; 

		/* leds: all off for a "normal" shutdown */
		for (led = (unsigned int) 0; led < (unsigned int) lpc21XX_led_size (); led++)
		{
				lpc21XX_led_disable ((unsigned char) led);
		}

		lpc21XX_delay ((unsigned int) 64);

		(void) lpc21XX_term ();

		/*@i@*/ while (TRUE)
		{
				LPC21XX_POWER_DOWN;
		}
}

void lpc21XX_halt (void)
{
		unsigned int led; 

		/* leds: all on for a "fault" shutdown */
		for (led = (unsigned int) 0; led < (unsigned int) lpc21XX_led_size (); led++)
		{
				lpc21XX_led_enable ((unsigned char) led);
		}

