matthewgream/gps-logger-mg/mod_lpc21XXhal.c
		lpc21XX_delay ((unsigned int) 64);

		(void) lpc21XX_term ();

		/*@i@*/ while (TRUE)
		{
				LPC21XX_POWER_DOWN;
		}
}

void lpc21XX_reset (void)
{
		unsigned int led; 

		/* leds: all off for a "normal" shutdown */
		for (led = (unsigned int) 0; led < (unsigned int) lpc21XX_led_size (); led++)
		{
				lpc21XX_led_disable ((unsigned char) led);
		}

		lpc21XX_delay ((unsigned int) 64);

		(void) lpc21XX_term ();

		WDMOD = (unsigned long) WDMOD_WDRESET;
		WDTC = (unsigned long) LPC21XX_PCLK; /* one CLOCK */
		WDFEED = (unsigned long) 0xAA;
		WDFEED = (unsigned long) 0x55;
}

/* ----------------------------------------------------------------------------------------------------*/

#define LPC21XX_LED_TOGGLE_COUNT  ((unsigned char) 4)
#define LPC21XX_LED_TOGGLE_DELAY  ((unsigned int) (128*1024))

static const unsigned long lpc21XX_led_cfg_list [] =
{
		(unsigned long) 0x00000004, /* v1.0: stat0 (red), v2.4: stat (red) */
#ifdef HARDWARE_10
		(unsigned long) 0x00000400	/* v1.0: stat1 (red) */
#endif
#ifdef HARDWARE_24
		(unsigned long) 0x00000400, /* v2.4: stat (green) */
		(unsigned long) 0x00002000	/* v2.4: stat (blue) */
#endif

};
#define lpc21XX_led_cfg_size ((unsigned char) (sizeof (lpc21XX_led_cfg_list) / sizeof (unsigned long)))
#ifdef HARDWARE_24
#define lpc21XX_led_cfg_mask ((unsigned long) 0x00002404)
#else
#define lpc21XX_led_cfg_mask ((unsigned long) 0x00000404)
#endif

void lpc21XX_led_enable (const unsigned char led)
{
		assert (led <= lpc21XX_led_cfg_size);

		IO0CLR = lpc21XX_led_cfg_list [led];
}

void lpc21XX_led_disable (const unsigned char led)
{
		assert (led <= lpc21XX_led_cfg_size);

		IO0SET = lpc21XX_led_cfg_list [led];
}

void lpc21XX_led_toggle (const unsigned char led)
{
		assert (led <= lpc21XX_led_cfg_size);

		if ((IO0PIN & lpc21XX_led_cfg_list [led]) == 0x00)
		{
				IO0SET = lpc21XX_led_cfg_list [led];
		}
		else
		{
				IO0CLR = lpc21XX_led_cfg_list [led];
		}
}

unsigned char lpc21XX_led_size (void)
{
		return lpc21XX_led_cfg_size;
}

void lpc21XX_led_init (void)
{
		unsigned int cnt, led;
		unsigned int dly;

		IO0DIR |= lpc21XX_led_cfg_mask;
		IO0SET = lpc21XX_led_cfg_mask;

		for (cnt = (unsigned int) 0; cnt < (unsigned int) LPC21XX_LED_TOGGLE_COUNT; cnt++)
		{
				for (led = (unsigned int) 0; led < (unsigned int) lpc21XX_led_cfg_size; led++)
				{
						IO0CLR = lpc21XX_led_cfg_list [led];
						for (dly = (unsigned int) 0; dly < LPC21XX_LED_TOGGLE_DELAY; dly++)
								/*@i@*/ ;
						IO0SET = lpc21XX_led_cfg_list [led];
				}
		}
}

/* ----------------------------------------------------------------------------------------------------*/

#define LPC21XX_UART_BUFFER_SIZE ((unsigned int) 512)	   /* must be a power of 2 !! */

typedef struct
{
		unsigned char data [LPC21XX_UART_BUFFER_SIZE];
		volatile unsigned int begin, end;
}
lpc21XX_uart_buffer_t;

static inline boolean lpc21XX_uart_buffer_empty (/*@notnull@*/ lpc21XX_uart_buffer_t * const bp)
{
		return (bp->begin == bp->end) ? TRUE : FALSE;
}

static inline void lpc21XX_uart_buffer_init (/*@notnull@*/ lpc21XX_uart_buffer_t * const bp)
{
		bp->end = bp->begin = 0;
}

static inline void lpc21XX_uart_buffer_enqueue (/*@notnull@*/ lpc21XX_uart_buffer_t * const bp, const unsigned char ch)
{
		const unsigned int en = (bp->end + (unsigned int) 1) & (LPC21XX_UART_BUFFER_SIZE - (unsigned int) 1);
		if (bp->begin != en) {
				bp->data [bp->end] = ch;
				bp->end = en;
		}
}

static inline unsigned char lpc21XX_uart_buffer_dequeue (/*@notnull@*/ lpc21XX_uart_buffer_t * const bp)
{
		const unsigned char ch = bp->data [bp->begin];
		if (bp->begin != bp->end) {
				bp->begin = (bp->begin + (unsigned int) 1) & (LPC21XX_UART_BUFFER_SIZE - (unsigned int) 1);
		} /* otherwise ch undefined! */
		return ch;
}

/* ----------------------------------------------------------------------------------------------------*/

typedef struct
{
		unsigned int rate;
		unsigned char dlm;
		unsigned char dll;
}
lpc21XX_uart_baud_cfg_t;

static const lpc21XX_uart_baud_cfg_t lpc21XX_uart_baud_cfg_list [] =
{
		{ (unsigned int)  1200, (unsigned char) 0x0C, (unsigned char) 0x00 },
		{ (unsigned int)  2400, (unsigned char) 0x06, (unsigned char) 0x00 },
		{ (unsigned int)  4800, (unsigned char) 0x03, (unsigned char) 0x00 },
		{ (unsigned int)  9600, (unsigned char) 0x01, (unsigned char) 0x80 },
		{ (unsigned int) 19200, (unsigned char) 0x00, (unsigned char) 0xC0 },
		{ (unsigned int) 38400, (unsigned char) 0x00, (unsigned char) 0x60 },
		{ (unsigned int) 57600, (unsigned char) 0x00, (unsigned char) 0x40 },
		{ (unsigned int)115200, (unsigned char) 0x00, (unsigned char) 0x20 }
};
#define lpc21XX_uart_baud_cfg_size ((unsigned char) (sizeof (lpc21XX_uart_baud_cfg_list) / sizeof (lpc21XX_uart_baud_cfg_t)))

/*@null@*/ /*@observer@*/ static const lpc21XX_uart_baud_cfg_t * lpc21XX_uart_baud_cfg_get (const unsigned int rate)
{
		unsigned int index;

		for (index = (unsigned int) 0; index < (unsigned int) lpc21XX_uart_baud_cfg_size; index++)
		{
				if (lpc21XX_uart_baud_cfg_list [index].rate == rate)
				{
						return &lpc21XX_uart_baud_cfg_list [index];
				}
		}

		return NULL;
}

boolean lpc21XX_uart_baud_supported (const unsigned int baud_rate)
{
		return lpc21XX_uart_baud_cfg_get (baud_rate) != NULL ? TRUE : FALSE;
}

/* ----------------------------------------------------------------------------------------------------*/

static boolean lpc21XX_uart0_irq_enabled;
static lpc21XX_uart_buffer_t lpc21XX_uart0_irq_buffer_rx;

static void __attribute__ ((interrupt ("IRQ"))) lpc21XX_uart0_irq_handler (void)
{
		while ((U0LSR & U0LSR_RDR) != (unsigned char) 0x00)
		{
				lpc21XX_uart_buffer_enqueue (&lpc21XX_uart0_irq_buffer_rx, (unsigned char) (U0RBR & 0xFF));
		}

		/*@i@*/ U0IIR;

		lpc21XX_irq_complete ();
}

void lpc21XX_uart0_init (const unsigned int baud_rate, const boolean enable_interrupts)
{
		const lpc21XX_uart_baud_cfg_t * const uart_cfg = lpc21XX_uart_baud_cfg_get (baud_rate);

		assert (uart_cfg != NULL);
		assert (baud_rate > (unsigned int) 0);

