matthewgream/gps-logger-mg/mod_lpc21XXhal.c
		PCONP |= PCONP_PCURT0;
		PINSEL0 |= 0x00000005; /* UART0 TXD/RXD */

		/* 8 bits, no parity, 1 stop-bit */
		U0LCR = (unsigned char) (U0LCR_Divisor_Latch_Access_Bit|(0x03 & U0LCR_Word_Length_Select_MASK));
		U0DLM = uart_cfg->dlm;
		U0DLL = uart_cfg->dll;
		U0LCR &= ~U0LCR_Divisor_Latch_Access_Bit;
		U0FCR = (unsigned char) U0FCR_FIFO_Enable;

		/* flush interrupts, rx fifo and status register */
		/*@i@*/ U0IIR;
		/*@i@*/ U0RBR;
		/*@i@*/ U0LSR;

		/* configure interrupt handling */
		lpc21XX_uart0_irq_enabled = enable_interrupts;
		if (lpc21XX_uart0_irq_enabled)
		{
				lpc21XX_uart_buffer_init (&lpc21XX_uart0_irq_buffer_rx);
				lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_UART0, (unsigned long) lpc21XX_uart0_irq_handler);
				U0IER = (unsigned char) U1IER_RBR_Interrupt_Enable;
		}
		else
		{
				U0IER = (unsigned char) 0x00;
		}
}

void lpc21XX_uart0_term (void)
{
		/* configure interrupt handling */
		if (lpc21XX_uart0_irq_enabled)
		{
				lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_UART0);
				U0IER = (unsigned char) 0x00;
		}

		/* flush interrupts, rx fifo and status register */
		/*@i@*/ U0IIR;
		/*@i@*/ U0RBR;
		/*@i@*/ U0LSR;

		PINSEL0 &= ~0x00000005; /* UART0 TXD/RXD */
		PCONP &= ~PCONP_PCURT0;
}

void lpc21XX_uart0_set_fifo_level (const unsigned char value)
{
		U0FCR = ((value << U0FCR_Rx_Trigger_Level_Select_BIT) & U0FCR_Rx_Trigger_Level_Select_MASK) \
				| U0FCR_FIFO_Enable;
}

void lpc21XX_uart0_putc (const unsigned char ch)
{
		while ((U0LSR & U0LSR_THRE) == (unsigned char) 0x00)
				/*@i@*/ ;
		U0THR = ch;
}

unsigned char lpc21XX_uart0_getc (void)
{
		if (lpc21XX_uart0_irq_enabled)
		{
				/*@i@*/ while (lpc21XX_uart_buffer_empty (&lpc21XX_uart0_irq_buffer_rx))
						LPC21XX_POWER_IDLE;
				return lpc21XX_uart_buffer_dequeue (&lpc21XX_uart0_irq_buffer_rx);
		}
		else
		{
				while ((U0LSR & U0LSR_RDR) == (unsigned char) 0x00)
						/*@i@*/ ;
				return (U0RBR);
		}
}

void lpc21XX_uart0_write (const unsigned char * const buffer, const unsigned int length)
{
		unsigned int count = 0;
		while (count < length)
		{
				while ((U0LSR & U0LSR_THRE) == (unsigned char) 0x00)
						/*@i@*/ ;
				U0THR = buffer [count++];
		}
}

unsigned int lpc21XX_uart0_gets (unsigned char * const buffer, const unsigned int length)
{
		unsigned int count = 0;
		while (count < length)
		{
				if (lpc21XX_uart0_irq_enabled)
				{
						/*@i@*/ while (lpc21XX_uart_buffer_empty (&lpc21XX_uart0_irq_buffer_rx))
								LPC21XX_POWER_IDLE;
						if ((buffer [count++] = lpc21XX_uart_buffer_dequeue (&lpc21XX_uart0_irq_buffer_rx)) == (unsigned char) '\n')
								break;
				}
				else
				{
						while ((U0LSR & U0LSR_RDR) == (unsigned char) 0x00)
								/*@i@*/ ;
						if ((buffer [count++] = U0RBR) == (unsigned char) '\n')
								break;
				}
		}
		return count;
}

/* ----------------------------------------------------------------------------------------------------*/

static boolean lpc21XX_uart1_irq_enabled;
static lpc21XX_uart_buffer_t lpc21XX_uart1_irq_buffer_rx;

static void __attribute__ ((interrupt ("IRQ"))) lpc21XX_uart1_irq_handler (void)
{
		while ((U1LSR & U1LSR_RDR) != (unsigned char) 0x00)
		{
				lpc21XX_uart_buffer_enqueue (&lpc21XX_uart1_irq_buffer_rx, (unsigned char) (U1RBR & 0xFF));
		}

		/*@i@*/ U1IIR;

		lpc21XX_irq_complete ();
}

void lpc21XX_uart1_init (const unsigned int baud_rate, const boolean enable_interrupts)
{
		const lpc21XX_uart_baud_cfg_t * const uart_cfg = lpc21XX_uart_baud_cfg_get (baud_rate);

		assert (uart_cfg != NULL);
		assert (baud_rate > (unsigned int) 0);

		PCONP |= PCONP_PCURT1;
		PINSEL0 |= 0x00050000; /* UART1 TXD/RXD */

		/* 8 bits, no parity, 1 stop-bit */
		U1LCR = (unsigned char) (U1LCR_Divisor_Latch_Access_Bit|(0x03 & U1LCR_Word_Length_Select_MASK));
		U1DLM = uart_cfg->dlm;
		U1DLL = uart_cfg->dll;
		U1LCR &= ~U1LCR_Divisor_Latch_Access_Bit;
		U1FCR = (unsigned char) U1FCR_FIFO_Enable;
		U1MCR = (unsigned char) 0x00;

		/* flush interrupts, rx fifo and status register */
		/*@i@*/ U1IIR;
		/*@i@*/ U1RBR;
		/*@i@*/ U1LSR;

		/* configure interrupt handling */
		lpc21XX_uart1_irq_enabled = enable_interrupts;
		if (lpc21XX_uart1_irq_enabled)
		{
				lpc21XX_uart_buffer_init (&lpc21XX_uart1_irq_buffer_rx);
				lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_UART1, (unsigned long) lpc21XX_uart1_irq_handler);
				U1IER = (unsigned char) U1IER_RBR_Interrupt_Enable;
		}
		else
		{
				U1IER = (unsigned char) 0x00;
		}
}

void lpc21XX_uart1_term (void)
{
		/* configure interrupt handling */
		if (lpc21XX_uart1_irq_enabled)
		{
				lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_UART1);
				U1IER = (unsigned char) 0x00;
		}

		/* flush interrupts, rx fifo and status register */
		/*@i@*/ U1IIR;
		/*@i@*/ U1RBR;
		/*@i@*/ U1LSR;

		PINSEL0 &= ~0x00050000; /* UART1 TXD/RXD */
		PCONP &= ~PCONP_PCURT1;
}

void lpc21XX_uart1_set_fifo_level (const unsigned char value)
{
		U1FCR = ((value << U1FCR_Rx_Trigger_Level_Select_BIT) & U1FCR_Rx_Trigger_Level_Select_MASK) \
				| U1FCR_FIFO_Enable;
}

void lpc21XX_uart1_putc (const unsigned char ch)
{
		while ((U1LSR & U1LSR_THRE) != (unsigned char) 0x00)
				/*@i@*/ ;
		U1THR = ch;
}

unsigned char lpc21XX_uart1_getc (void)
{
		if (lpc21XX_uart1_irq_enabled)
		{
				/*@i@*/ while (lpc21XX_uart_buffer_empty (&lpc21XX_uart1_irq_buffer_rx))
						LPC21XX_POWER_IDLE;
				return lpc21XX_uart_buffer_dequeue (&lpc21XX_uart1_irq_buffer_rx);
		}
		else
		{
				while ((U1LSR & U1LSR_RDR) != (unsigned char) 0x00)
						/*@i@*/ ;
				return (U1RBR);
		}
}

void lpc21XX_uart1_write (const unsigned char * const buffer, const unsigned int length)
{
		unsigned int count = 0;
		while (count < length)
		{
				while ((U1LSR & U1LSR_THRE) == (unsigned char) 0x00)
						/*@i@*/ ;
				U1THR = buffer [count++];
		}
}

unsigned int lpc21XX_uart1_gets (unsigned char * const buffer, const unsigned int length)
{
		unsigned int count = 0;
		while (count < length)
		{
				if (lpc21XX_uart1_irq_enabled)
				{
						/*@i@*/ while (lpc21XX_uart_buffer_empty (&lpc21XX_uart1_irq_buffer_rx))
								LPC21XX_POWER_IDLE;
						if ((buffer [count++] = lpc21XX_uart_buffer_dequeue (&lpc21XX_uart1_irq_buffer_rx)) == (unsigned char) '\n')
								break;
				}
				else
				{
						while ((U1LSR & U1LSR_RDR) == (unsigned char) 0x00)
								/*@i@*/ ;
						if ((buffer [count++] = U1RBR) == (unsigned char) '\n')
								break;
				}
		}
		return count;
}

/* ----------------------------------------------------------------------------------------------------*/

void lpc21XX_spi_init (void)
{
		unsigned int i;

		/* XXX: should we PCONP be after we setup the pins? */
		PCONP |= PCONP_PCSPIO;

		IO0DIR |= LPC21XX_SPI_CS;
		PINSEL0 |= (1L<<8)|(1L<<10)|(1L<<12); /* 3 SPI pins */
		IO0SET |= LPC21XX_SPI_CS;

