matthewgream/gps-logger-mg/mod_lpc21XXhal.c
		/* XXX: for V2.4, this changes to 0x3C */
		SPCCR = (unsigned char) 0x20; /* clock = pclk/32 */
		SPCR = (unsigned char) (SPCR_CPHA|SPCR_CPOL|SPCR_MSTR);

		for (i = (unsigned int) 0; i < (unsigned int) 16; i++)
		{
				/*@i@*/ SPDR;
		}
}

void lpc21XX_spi_term (void)
{
		PCONP &= ~PCONP_PCSPIO;

		PINSEL0 &= ~((1L<<8)|(1L<<10)|(1L<<12)); /* 3 SPI pins */
		IO0DIR &= ~LPC21XX_SPI_CS;
}

#ifndef INLINE
INLINE_DECL void lpc21XX_spi_put (const unsigned char ch)
{
		SPDR = ch;
		while ((SPSR & SPSR_SPIF) == (unsigned char) 0x00)
				/*@i@*/ ;
}
#endif

#ifndef INLINE
INLINE_DECL unsigned char lpc21XX_spi_get (void)
{
		SPDR = (unsigned char) 0xFF;
		while ((SPSR & SPSR_SPIF) == (unsigned char) 0x00)
				/*@i@*/ ;
		return SPDR;
}
#endif

#ifndef INLINE
INLINE_DECL void lpc21XX_spi_acquire (void)
{
		IO0CLR |= LPC21XX_SPI_CS;
}
#endif

#ifndef INLINE
INLINE_DECL void lpc21XX_spi_release (void)
{
		IO0SET |= LPC21XX_SPI_CS;
}
#endif

/* ----------------------------------------------------------------------------------------------------*/

/*@null@*/ static lpc21XX_timer_callback_t lpc21XX_timer0_callback;

static void __attribute__ ((interrupt ("IRQ"))) lpc21XX_timer0_irq_handler (void)
{
		if ((T0IR & T0IR_MR0) != (unsigned long) 0)
		{
				if (lpc21XX_timer0_callback != NULL)
				{
						(*lpc21XX_timer0_callback) ();
				}

				T0IR = (unsigned long) T0IR_MR0;
		}

		lpc21XX_irq_complete ();
}

void lpc21XX_timer0_init (const lpc21XX_timer_callback_t callback)
{
		assert (callback != NULL);

		PCONP |= PCONP_PCTIM0;

		lpc21XX_timer0_callback = callback;
		lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_TIMER0, (unsigned long) lpc21XX_timer0_irq_handler);

		T0TC = (unsigned long) 0x00000000; /* current timer-counter, incremented when prescale-counter wraps */
		T0PC = (unsigned long) 0x00000000; /* current prescale-counter, incremented each pclk */
		T0PR = (unsigned long) LPC21XX_CCLK; /* threshold prescale-counter (1/1000'th of a second) */
		T0MR0 = (unsigned long) 0x00000000; /* threshold timer-counter */
		T0MCR = (unsigned long) (T0MCR_Interrupt_on_MR0|T0MCR_Reset_on_MR0|T0MCR_Stop_on_MR0);
		T0CTCR = (unsigned long) (0x00 & T0CTCR_Mode_MASK); /* timer mode */
		T0TCR = (unsigned long) 0x00;
}

void lpc21XX_timer0_term (void)
{
		lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_TIMER0);
		lpc21XX_timer0_callback = NULL;

		T0TCR = (unsigned char) 0x00;

		PCONP &= ~PCONP_PCTIM0;
}

void lpc21XX_timer0_start (const unsigned long secs)
{
		assert (secs > (unsigned long) 0);
		assert (lpc21XX_timer0_callback != NULL);

		T0MR0 = (unsigned long) (secs * 1000); /* threshold timer-counter */
		T0TCR = (unsigned long) T0TCR_Counter_Reset;
		LPC21XX_NOP (); /* at least one clock cycle (shouldn't be needed really ...) */
		T0TCR = (unsigned long) T0TCR_Counter_Enable;
}

void lpc21XX_timer0_stop (void)
{
		T0TCR = (unsigned long) 0;
}

#ifndef INLINE
INLINE_DECL void lpc21XX_timer0_suspend (void)
{
		T0TCR = (unsigned long) 0;
}
#endif

#ifndef INLINE
INLINE_DECL void lpc21XX_timer0_resume (void)
{
		T0TCR = (unsigned long) T0TCR_Counter_Enable;
}
#endif

/* ----------------------------------------------------------------------------------------------------*/

/*@null@*/ static lpc21XX_powerfail_callback_t lpc21XX_powerfail_callback;

static void __attribute__ ((interrupt ("IRQ"))) lpc21XX_powerfail_irq_handler (void)
{
		if (lpc21XX_powerfail_callback != NULL)
		{
				(*lpc21XX_powerfail_callback) ();
		}
		lpc21XX_irq_complete ();
}

void lpc21XX_powerfail_enable (const lpc21XX_powerfail_callback_t callback)
{
		assert (callback != NULL);

		lpc21XX_powerfail_callback = callback;
		lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_BOD, (unsigned long) lpc21XX_powerfail_irq_handler);

		PCON &= ~(1<<4);
}

void lpc21XX_powerfail_disable (void)
{
		PCON |= (1<<4);

		lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_BOD);
		lpc21XX_powerfail_callback = NULL;
}

/* ----------------------------------------------------------------------------------------------------*/

void lpc21XX_watchdog_enable (const unsigned long secs)
{
		assert (secs > (unsigned long) 0);

		WDMOD = (unsigned long) WDMOD_WDRESET;
		WDTC = (unsigned long) (LPC21XX_PCLK * 1000 / 4) * (unsigned long) secs;
		WDFEED = (unsigned long) 0xAA;
		WDFEED = (unsigned long) 0x55;
}

void lpc21XX_watchdog_disable (void)
{
		WDMOD = (unsigned long) 0;
}

#ifndef INLINE
INLINE_DECL void lpc21XX_watchdog_kick (void)
{
		WDFEED = (unsigned long) 0xAA;
		WDFEED = (unsigned long) 0x55;
}
#endif

/* ----------------------------------------------------------------------------------------------------*/

/*@null@*/ static lpc21XX_shutdown_callback_t lpc21XX_shutdown_callback;

#ifdef HARDWARE_24
static void __attribute__ ((interrupt ("IRQ"))) lpc21XX_shutdown_irq_handler (void)
{
		lpc21XX_shutdown_trigger ();
		EXTINT = (unsigned char) ((1<<EXTINT_EINT0_BIT) & EXTINT_EINT0_MASK);
		lpc21XX_irq_complete ();
}
#endif

void lpc21XX_shutdown_trigger (void)
{
		if (lpc21XX_shutdown_callback != NULL)
		{
				(*lpc21XX_shutdown_callback) ();
		}
}

void lpc21XX_shutdown_enable (const lpc21XX_shutdown_callback_t callback)
{
		assert (callback != NULL);

		lpc21XX_shutdown_callback = callback;

#ifdef HARDWARE_24
		PINSEL1 |= (1L<<0);
		IO0DIR &= ~(1L<<16);

		EXTINT = (unsigned char) ((1<<EXTINT_EINT0_BIT) & EXTINT_EINT0_MASK);
		EXTMODE |= (1<<0);
		EXTPOLAR &= ~(1<<0);

		lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_EINT0, (unsigned long) lpc21XX_shutdown_irq_handler);
#endif
}

void lpc21XX_shutdown_disable (void)
{
#ifdef HARDWARE_24
		lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_EINT0);

		EXTINT = (unsigned char) ((1<<EXTINT_EINT0_BIT) & EXTINT_EINT0_MASK);
		EXTMODE &= ~(1<<0);

		PINSEL1 &= ~(1L<<0);
#endif

		lpc21XX_shutdown_callback = NULL;
}

/* ----------------------------------------------------------------------------------------------------*/

void lpc21XX_gpshw_enable (void)
{
#ifdef HARDWARE_24
		IO0DIR |= 0x40000000;
		IO0CLR |= 0x40000000;
#endif
}

void lpc21XX_gpshw_disable (void)
{
#ifdef HARDWARE_24
		IO0DIR &= ~0x40000000;
#endif
}

/* ----------------------------------------------------------------------------------------------------*/

#ifdef TEST_ENABLED

static volatile unsigned int lpc21XX_test_trigger;
static void lpc21XX_test_handler1 (void)
{
		lpc21XX_test_trigger++;
}

test_result_t lpc21XX_test (void)
{
		/* lpc21XX irq_control */
		(void) lpc21XX_irq_restore (lpc21XX_irq_disable ());
		(void) lpc21XX_irq_restore (lpc21XX_irq_enable ());
#ifdef LPC21XX_ENABLE_FIQ
		(void) lpc21XX_fiq_restore (lpc21XX_fiq_disable ());
		(void) lpc21XX_fiq_restore (lpc21XX_fiq_enable ());
#endif

		/* lpc21XX irq_vector */
		lpc21XX_test_trigger = 0;
		lpc21XX_irq_vector_attach (LPC21XX_IRQ_CHANNEL_WDT, (unsigned long) lpc21XX_test_handler1);
		lpc21XX_irq_vector_detach (LPC21XX_IRQ_CHANNEL_WDT);
		test_assert (lpc21XX_test_trigger == 0);

		/* lpc21XX rtc */
		lpc21XX_rtc_enable ();
		test_assert (lpc21XX_rtc_enabled ());
		{ lpc21XX_rtc_t c = { { (unsigned char) (2006 - 1980), (unsigned char) 9, (unsigned char) 22,
								(unsigned char) 8, (unsigned char) 52, (unsigned char) 5 } };
		  lpc21XX_rtc_set (&c);
		}
		{ lpc21XX_rtc_t c;
		  lpc21XX_rtc_get (&c);
		  test_assert (c.e [LPC21XX_RTC_ELEM_YY] == (unsigned char) (2006 - 1980) && c.e [LPC21XX_RTC_ELEM_MO] == (unsigned char) 9 &&
					   c.e [LPC21XX_RTC_ELEM_DD] == (unsigned char) 22 && c.e [LPC21XX_RTC_ELEM_HH] == (unsigned char) 8 &&
					   c.e [LPC21XX_RTC_ELEM_MM] == (unsigned char) 52 && c.e [LPC21XX_RTC_ELEM_SS] >= (unsigned char) 5);
		}
		lpc21XX_rtc_disable ();
		test_assert (!lpc21XX_rtc_enabled ());

		/* lpc21XX delay */
		lpc21XX_delay ((unsigned int) 512);

		/* lpc21XX idle */

		/* lpc21XX down */

		/* lpc21XX halt */

		/* lpc21XX led */
		test_assert (lpc21XX_led_size () > (unsigned char) 0);
		lpc21XX_led_enable ((unsigned char) 0);
		lpc21XX_led_disable ((unsigned char) 0);

		/* lpc21XX uart */

		/* lpc21XX spi */

#ifdef XXX /*XXX: we need to get the timer0 handler test working again*/
		/* lpc21XX timer0 */
		lpc21XX_test_trigger = 0;
		lpc21XX_timer0_start (1, lpc21XX_test_handler2, NULL);
		DPRINTF (("."));
		while (lpc21XX_test_trigger == 0)
				;
		lpc21XX_test_trigger = 0;
		lpc21XX_timer0_restart ();
		while (lpc21XX_test_trigger == 0)
				;
		lpc21XX_timer0_stop ();
		/* */
		lpc21XX_test_trigger = 0;
		lpc21XX_timer1_start (1, lpc21XX_test_handler2, NULL);
		DPRINTF (("."));
		while (lpc21XX_test_trigger == 0)
				;
		lpc21XX_test_trigger = 0;
		lpc21XX_timer1_restart ();
		while (lpc21XX_test_trigger == 0)
				;
		lpc21XX_timer1_stop ();
#endif

		/* lpc21XX powerfail */

		/* lpc21XX shutdown */

		/* lpc21XX gpshw */

		/* lpc21XX watchdog */
		lpc21XX_watchdog_enable ((unsigned long) 30);
		lpc21XX_watchdog_kick ();
		lpc21XX_watchdog_disable ();

		return TEST_RESULT_OKAY;
}

#endif

/* ----------------------------------------------------------------------------------------------------*/
